# -*- org-use-property-inheritance: t; -*-
#+TITLE: WIP: DNS: add canary
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+ISSUE: https://github.com/kubernetes/k8s.io/pull/147
#+CREATOR: ii.coop
#+DATE: October 24th, 2018
#+PROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (file-name-base buffer-file-name)
#+PROPERTY: header-args:shell  :var SOCKET=(symbol-value 'socket)
#+PROPERTY: header-args:shell+ :results verbatim code
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE"


octodns-compare does similar comparison type stuff,
 though it works at the provider level
octodns-report does actual DNS queries against servers
using octoDNS to get the list of things to check.


https://github.com/miekg/exdns

https://www.knot-dns.cz GPL / Support RFC RFC2136
https://stackoverflow.com/questions/46892178/google-cloud-dns-secondary-dns-supportt r

https://gist.github.com/yzguy/e648209d332520956ecabe6e64db24cb

#+BEGIN_SRC python
#!/usr/bin/env python

import sys
import dns.query
import dns.zone
import dns.name

from dns.exception import DNSException
from dns.rdatatype import SOA

config = {
    'masters': {
        'provider1': '10.10.10.10',
        'provider2': '20.20.20.20'
    },
    'domains': [
        'domain.com',
        'domain.net'
    ]
}

# Zone Transfer
def get_zone(domain, master):
    try:
        zone = dns.zone.from_xfr(dns.query.xfr(master, domain, relativize=False), relativize=False)
    except DNSException as e:
        return None, e

    return zone, None

# Compare a zone against another, return data
def compare_zones(z1, z2):
    data = {
        'totals': [
            get_zone_total(z1),
            get_zone_total(z2)
        ],
        'missing': {},
        'matches': [],
        'mismatches': {}
    }

    # Loop through all the name to rdataset pairs
    for (name, z1_rdataset) in z1.iterate_rdatasets():

        # Skip SOA records (different between providers)
        if z1_rdataset.rdtype == SOA:
** Secrets / ENV Setup
 #+NAME: create project configuration
 #+BEGIN_SRC tmate
   export PROJECT=kubernetes-public
   export EMAIL=hh@ii.coop

   gcloud config configurations create $PROJECT --activate \
     || gcloud config configurations activate $PROJECT
   gcloud config set account $EMAIL
   gcloud config set project $PROJECT
 #+END_SRC
 
#+NAME: create project configuration
 #+BEGIN_SRC tmate
   export PROJECT=kubernetes-public
   export EMAIL=hh@ii.coop

   gcloud config configurations create $PROJECT --activate \
     || gcloud config configurations activate $PROJECT
   gcloud config set account $EMAIL
   gcloud config set project $PROJECT
 #+END_SRC

#+NAME: test canary
#+BEGIN_SRC tmate
  (
    cd ~/kubernetes/k8s.io/dns
    ~/kubernetes/k8s.io/dns/test.sh canary
    echo exit=$?
  ) 2>&1
#+END_SRC

#+NAME: test.sh canary
#+BEGIN_SRC shell :results verbatim :path ~/kubernetes/k8s.io/dns
  (
    cd ~/kubernetes/k8s.io/dns
    ~/kubernetes/k8s.io/dns/test.sh canary
    echo exit=$?
  ) 2>&1
#+END_SRC

#+RESULTS: test.sh canary
#+begin_example
canary
Testing canary via ns-cloud-c1.googledomains.com. and ns-cloud-b1.googledomains.com.
1 aspmx.l.google.com. 5 alt1.aspmx.l.google.com. 5 alt2.aspmx.l.google.com. 10 alt3.aspmx.l.google.com. 10 alt4.aspmx.l.google.com.
FAIL: MX canary.k8s.io:
  got:
1 aspmx.l.google.com.
5 alt1.aspmx.l.google.com.
5 alt2.aspmx.l.google.com.
10 alt3.aspmx.l.google.com.
10 alt4.aspmx.l.google.com.
--------------------
exit=2
#+end_example





